alplabai/gd32-bridge-firmware/hal/gd32/init.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * GD32G5x3 backend for the bridge HAL.  Selected by setting
 * BRIDGE_HAL_BACKEND=gd32 in CMakeLists.txt.  Links
 * against the GigaDevice firmware-library wrapper.  This repo does NOT
 * vendor that tree: pass -DGD32_VENDOR_DIR=<path> pointing at a checkout
 * of alp-sdk's vendors/gd32_firmware_library/ (a verbatim mirror of GD's
 * v1.5.0 release).  Left unset, the build falls back to
 * ../../vendors/gd32_firmware_library resolved against this source tree
 * -- the pre-split layout, when this tree was nested at
 * <alp-sdk>/firmware/gd32-bridge/.  See README.md "Build".
 *
 * Status:
 *   The hooks below have real bodies -- selecting this backend drives
 *   silicon.  The per-hook record that follows is the state AS LANDED,
 *   not a plan: DONE, PARTIAL (defaults accepted, the rest refused) or
 *   an unconditional sentinel where the SoM revision has no HW path.
 *   Whatever a hook refuses returns BRIDGE_HW_ERR_NOTIMPL, which
 *   reaches the wire as STATUS_NOSUPPORT (status_from_hw() in
 *   src/protocol.c).
 *
 * Per-hook state, in the order the bodies landed (increasing risk):
 *
 *   1. RESET_REASON          -- DONE: RCU_RSTSCK decode + RSTFC clear.
 *   2. GPIO_READ / WRITE     -- DONE: 18-pad map (E1M IO8..IO35),
 *                               boot configures all as INPUT + PULL_UP,
 *                               write auto-promotes to OUTPUT push-pull.
 *   3. TRNG_READ             -- DONE: NIST SP800-90B mode init in
 *                               bridge_hw_init, DRDY-polled byte read
 *                               with bounded timeout.
 *   4. TMU_COMPUTE           -- DONE: 9 of 12 host functions via TMU
 *                               (tan / exp / tanh NOSUPPORT -- host
 *                               wrapper can libm-fallback in a future
 *                               commit).  F32 + Q31 paths.
 *   5. DAC_SET / GET         -- DONE: channel 0 -> DAC0_OUT0 / PA4,
 *                               channel 1 -> DAC1_OUT0 / PA6, mV<->12-bit
 *                               code at VREF=1800mV (V2N analog supply).
 *   6. PWM_SET / GET         -- DONE: 8 channels across TIMER0 + TIMER7
 *                               at 1 us LSB; pin AFs per datasheet Rev2.0.
 *   7. PWM_CONFIGURE         -- PARTIAL: defaults (edge-aligned, no
 *                               dead-time, no break input) accepted;
 *                               non-defaults NOSUPPORT pending follow-up.
 *   8. ADC_READ              -- DONE: 8-pad map across ADC0..3, single-
 *                               shot polling, mV<->code at VREF=1800mV.
 *   9. ADC_CONFIGURE         -- DONE: per-channel sample-cycle,
 *                               oversample-ratio and 6/8/10/12-bit
 *                               resolution settings cached + applied;
 *                               14/16-bit effective modes are NOSUPPORT.
 *   10. ADC_STREAM_*         -- DONE (§C.23): DMA0/1-backed
 *                               continuous acquisition.  Two parallel
 *                               streams; each owns a 1024-sample
 *                               circular ring buffer + a DMA channel
 *                               driving it peripheral-to-memory.
 *                               Host drains via polled stream_read;
 *                               write cursor recovered from the DMA
 *                               counter.
 *   11. QENC_READ / RESET    -- DONE: 4 encoders across TIMER1/2/3/4
 *                               in quadrature decoder mode 2 (X4).
 *   12. COUNTER_READ         -- DONE: Cortex-M33 DWT cycle counter
 *                               (32-bit free-running at core clock).
 *   13. PWM_CAPTURE_*        -- DONE (§C.15a): TIMERx input-capture
 *                               with polled drain.  V2N pad map binds
 *                               the COMPLEMENTARY (CHxN) outputs --
 *                               BEGIN reconfigures the channel as
 *                               input-capture but the captured edges
 *                               only land once a future hardware-
 *                               bring-up commit reworks the pad
 *                               routing onto the timer's main CHx
 *                               input mux.  Structural code path
 *                               (config + drain + ns conversion) is
 *                               complete and exercised end-to-end.
 *   14. PWM_SINGLE_PULSE     -- DONE: TIMERx OPM (one-pulse mode).
 *                               Switches the timer's whole SP-bit so
 *                               other channels on the same timer also
 *                               run as single-pulse until a PWM_SET
 *                               flips back to repetitive.
 *   15. TIMER_SYNC           -- DONE (§C.15b): master-slave SMC
 *                               config via timer_slave_mode_select
 *                               + timer_master_output0_trigger_source_select
 *                               + timer_master_slave_mode_config.
 *                               Wire `mode` byte translated to the
 *                               vendor's TIMER_SLAVE_MODE_* /
 *                               TIMER_QUAD_DECODER_MODE* encoding.
 *                               Slave ITIx looked up per (master, slave)
 *                               pair (timer_sync_iti_lookup, hal/gd32/
 *                               timer_sync_iti.c, UM p.570); an
 *                               unconnected pair returns INVAL.  Only
 *                               initialised TIMER0/TIMER7 are exposed;
 *                               TIMER19 id 2 returns RANGE (#142).
 *   16. POWER_MODE_SET       -- DONE (§C.15c + §C.25): mode 0/1
 *                               (run/sleep) accepted no-ops, mode 2
 *                               (deep-sleep) calls
 *                               pmu_to_deepsleepmode(LDO_LOWPOWER, WFI),
 *                               mode 3 (standby) calls
 *                               pmu_to_standbymode().  Wake-source
 *                               bitmap: GPIO enables PMU_WAKEUP_PIN0..4,
 *                               RTC + TIMER arm the RTC wakeup timer
 *                               at 0.5 ms LSB (IRC32K / DIV16); same
 *                               timer also honours wake_after_ms.
 *                               UART_RX / USB / ETH_LINK reject as
 *                               NOSUPPORT (no HW path on GD32G5).
 *   17. DA9292 fault forward -- 0xFF sentinel UNCONDITIONALLY: this
 *                               SoM rev wires the DA9292 fault nets
 *                               only to the Renesas (P37/P36); the
 *                               GD32 has no connection to them and no
 *                               I2C path to the PMIC.  Pin sampling
 *                               awaits a HW rev that mirrors the nets.
 *   18. ADC_DSP_*            -- DONE (§C.15d + §C.24): chain_open +
 *                               stage_push implemented as a 4-chain
 *                               pool with per-stage chunk reassembly
 *                               into a 260-byte buffer.  chain_bind
 *                               validates completeness + ordering
 *                               rules (FFT terminal, WINDOW preceding
 *                               FFT) and stores the binding on both
 *                               sides.  Runtime dispatch (#496) now
 *                               LANDED: a base-level pump routes bound
 *                               FIR/IIR chains through the FAC (filtered
 *                               STREAM_READ) and FFT chains through the
 *                               FFT block (CMD_ADC_SPECTRUM_READ; a plain
 *                               STREAM_READ answers NOSUPPORT).  One FAC
 *                               + one FFT block -> one filter + one FFT
 *                               stream at a time.
 *
 * A change that moves a hook between the states above updates this
 * header comment in the same commit.  Bench cadence is bounded by
 * maintainer access to the V2N EVK, so a hook can be code-complete
 * here and still carry the `needs-silicon` label until validated --
 * see docs/BENCH.md.
 *
 * Build assumptions:
 *   - arm-none-eabi-gcc on PATH (toolchain file
 *     toolchain/arm-none-eabi.cmake handles the rest).
 *   - the GigaDevice firmware-library tree reachable, either via
 *     -DGD32_VENDOR_DIR=<path> or the ../../vendors/gd32_firmware_library
 *     fallback (see the note at the top of this file).
 *   - Cortex-M33 + Thumb + soft-float ABI (matches the GigaDevice
 *     library's compile flags).
 *
 * Layout note (2026-06-05): this backend was split move-only into per-peripheral TUs under hal/gd32/ (fw v0.2.8 refactor); this file owns boot bring-up + board-level reads, shared tables/helpers are declared in gd32_common.h.
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "bridge_hw.h"

